#+TITLE:Amazon Web Services (AWS)
#+Author: Saiadithya


An EC2 instance is like a remote computer running Windows or Linux and
on which you can install whatever software you want, including a Web
server running PHP code and a database server.

Amazon S3 is just a storage service, typically used to store large
binary files. Amazon also has other storage and database services,
like RDS for relational databases and DynamoDB for NoSQL

** Change the interpreter on the go

#+begin_src emacs-lisp :results none
(setq org-babel-python-command "python3")
#+end_src


#+BEGIN_SRC python :results output :session s3
import sys
print(sys.version)
#+END_SRC

#+RESULTS:
: 3.5.2 (default, Nov 17 2016, 17:05:23)
: [GCC 5.4.0 20160609
** Storing data in a bucket


#+BEGIN_SRC python :results output :session s3
s3.Object('saitempbucket', 'new.txt').put(Body=open('/home/sai/new.txt', 'rb'))
#+END_SRC

#+RESULTS:
: {'ETag': '"a8274137b9d344e89bc27d45ffd06669"', 'ResponseMetadata': {'RequestId': '93933E1B26A91BB0', 'HostId': 'xoJvPrCCUo1i0em4PjIbIL6/Sce62qeqABnznEONyldR/eT1LEm7NiPn13vC/TZXX8qMytK4ThM=', 'RetryAttempts': 0, 'HTTPStatusCode': 200, 'HTTPHeaders': {'date': 'Sun, 29 Jan 2017 04:20:16 GMT', 'x-amz-request-id': '93933E1B26A91BB0', 'server': 'AmazonS3', 'content-length': '0', 'etag': '"a8274137b9d344e89bc27d45ffd06669"', 'x-amz-id-2': 'xoJvPrCCUo1i0em4PjIbIL6/Sce62qeqABnznEONyldR/eT1LEm7NiPn13vC/TZXX8qMytK4ThM='}}}

** Enable logging
#+BEGIN_SRC python :results output :session s3
bucket.enable_logging(target_bucket='saitempbucket',target_prefix=bucket.name)
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/usr/local/lib/python3.5/dist-packages/boto/s3/bucket.py", line 1195, in enable_logging
:     return self.set_xml_logging(blogging.to_xml(), headers=headers)
:   File "/usr/local/lib/python3.5/dist-packages/boto/s3/bucket.py", line 1170, in set_xml_logging
:     response.status, response.reason, body)
: boto.exception.S3ResponseError: S3ResponseError: 400 Bad Request
: <?xml version="1.0" encoding="UTF-8"?>
: <Error><Code>InvalidTargetBucketForLogging</Code><Message>You must give the log-delivery group WRITE and READ_ACP permissions to the target bucket</Message><TargetBucket>saitempbucket</TargetBucket><RequestId>0312E8EEF04C7A00</RequestId><HostId>72WcGcfsZWtD1hv3Dg1xePq1zNbVMocEDTrv2k4ZZdCt/MVkR38Rx5KDDcbwStftaSEqax6jqRk=</HostId></Error>

